{
  "persona_name": "Exploratory Elena",
  "course": "Introduction to Data Science with Beginning R and Python",
  "scenario": {
    "title": "Senior Undergraduate (Psychology)",
    "description": "Elena is a senior psychology student who is curious about data science. She wants exposure to R and Python to strengthen graduate school applications and improve her research toolkit. She has limited budget and moderate urgency."
  },
  "expectations": "An engaging, exploratory introduction with credible instruction, hands-on projects she can showcase, and clear guidance on next steps for graduate study or early research roles.",
  "phases": {
    "awareness": {
      "actions": [
        "Hears from a professor that coding strengthens research skills.",
        "Searches for beginner R courses and reads NC State program page.",
        "Skims student reviews and program outcomes."
      ],
      "pains": [
        "Unsure whether time and cost will pay off.",
        "Unclear about career path fit."
      ],
      "feelings": {
        "quote": "This could open new doors, but I’m not sure yet.",
        "feeling_score": 6
      },
      "opportunities": [
        "Position the course as a low-risk exploration with strong fundamentals.",
        "Show example student projects and academic use cases."
      ]
    },
    "consideration": {
      "actions": [
        "Compares NC State with Coursera and DataCamp for cost and credibility.",
        "Checks if there are student discounts or scholarships.",
        "Reviews project portfolio expectations."
      ],
      "pains": [
        "Concern about affordability versus cheaper platforms.",
        "Unsure whether academic credit or certificate matters for her."
      ],
      "feelings": {
        "quote": "If I’m going to spend, I want it to be credible.",
        "feeling_score": 7
      },
      "opportunities": [
        "Offer student pricing and highlight recognized certificates.",
        "Clarify transferability of skills and next-course pathways."
      ]
    },
    "enrollment": {
      "actions": [
        "Registers and pays out of pocket.",
        "Adds course dates to calendar and informs advisor."
      ],
      "pains": [
        "Budget constraints and buyer’s remorse risk.",
        "Doubts about long-term usefulness."
      ],
      "feelings": {
        "quote": "I hope this will be worth the sacrifice.",
        "feeling_score": 5
      },
      "opportunities": [
        "Flexible refund/deferral options and try-before-commit messaging.",
        "Pre-course orientation to confirm fit and expectations."
      ]
    },
    "engagement": {
      "actions": [
        "Completes hands-on labs using psychology-relevant datasets.",
        "Shares projects with peers and seeks feedback.",
        "Explores optional readings on research methods."
      ],
      "pains": [
        "Competing academic workload causes dips in momentum.",
        "May deprioritize when deadlines cluster."
      ],
      "feelings": {
        "quote": "This is fun, but I’m not sure I’ll stick with it.",
        "feeling_score": 6
      },
      "opportunities": [
        "Light gamification, peer challenges, and recognition of milestones.",
        "Advising on graduate-school pathways and research assistant roles."
      ]
    }
  }
}
