{
  "persona_name": "Methodical Maya",
  "course": "Introduction to Data Science with Beginning R and Python",
  "scenario": {
    "title": "Junior Business Analyst",
    "description": "Maya is a junior business analyst at a midsized tech-enabled company. She increasingly needs to analyze large datasets but feels limited by Excel. She wants beginner-friendly R and Python skills to improve performance and position herself for a promotion into a data-focused role."
  },
  "expectations": "Structured, beginner-accessible instruction with practical assignments she can apply to work, clear pacing guidance, and responsive support (office hours, TA help).",
  "phases": {
    "awareness": {
      "actions": [
        "Scans job postings requiring Python and R.",
        "Reviews NC State Continuing Education program pages.",
        "Watches a short overview video and skims FAQs."
      ],
      "pains": [
        "Overwhelmed by numerous beginner data science options.",
        "Uncertainty about which course level matches her skills."
      ],
      "feelings": {
        "quote": "I need the right first step so I don’t get overwhelmed.",
        "feeling_score": 6
      },
      "opportunities": [
        "Clearly label the course as beginner-friendly and career-relevant.",
        "Provide a simple ‘Is this course right for me?’ checklist."
      ]
    },
    "consideration": {
      "actions": [
        "Compares syllabus to bootcamps and LinkedIn Learning.",
        "Checks weekly time commitment and sample assignments.",
        "Looks for testimonials from working professionals."
      ],
      "pains": [
        "Concern about balancing workload with full-time job.",
        "Anxiety about pace and coding difficulty."
      ],
      "feelings": {
        "quote": "I can manage this if the structure is clear.",
        "feeling_score": 7
      },
      "opportunities": [
        "Publish transparent workload and pacing guidance.",
        "Showcase work-friendly success stories and example projects."
      ]
    },
    "enrollment": {
      "actions": [
        "Completes NC State registration portal.",
        "Submits tuition reimbursement paperwork to employer."
      ],
      "pains": [
        "Employer approval and HR documentation feel tedious.",
        "Nervous about cost and proving ROI."
      ],
      "feelings": {
        "quote": "This is an investment—I need to make it count.",
        "feeling_score": 5
      },
      "opportunities": [
        "Provide employer-facing outcome summaries and skills mapping.",
        "Offer clear receipts, completion letters, and timelines for reimbursement."
      ]
    },
    "engagement": {
      "actions": [
        "Attends live/virtual sessions and reviews recordings.",
        "Applies coding to workplace datasets.",
        "Seeks help in forums and office hours."
      ],
      "pains": [
        "Debugging frustrations on assignments.",
        "Time pressure when work gets busy."
      ],
      "feelings": {
        "quote": "This is challenging, but I can see my progress.",
        "feeling_score": 8
      },
      "opportunities": [
        "Provide annotated code walkthroughs and quick-reference cheatsheets.",
        "Facilitate peer study groups and TA office hours."
      ]
    }
  }
}
